# 1.论文基本信息

Recommender AI Agent: Integrating Large Language Models for Interactive Recommendations

XU HUANG，JIANXUN LIAN，YUXUAN LEI，JING YAO，DEFU LIAN，XING XIE

https://aka.ms/recagent.

Information systems → Recommender systems; Users and interactive retrieval;

L4，agent-as-recommender

# 2.一句话主张

以LLM为大脑，推荐模型为工具，并增强了记忆机制模块，反思模块，并采取先规划后执行结合动态示例的策略，实现可与用户对话交互，理解复杂意图的推荐系统，用用户模拟器策略进行离线评估，并蒸馏出了轻量级模型以实现大规模在线服务。

# 3.问题陈述

任务=利用大语言模型的先进能力与推荐模型融合。

挑战=大语言模型在特定领域进行推荐任务的知识局限，候选物品过多，上下文过长，对话轮数过长，规划任务能力，工具调用的观察。

缺口=交互式推荐的评估仍然是研究中较少涉足的领域，领域内没有对LLM+工具范式的研究

# 4.方法概要

LLM理解用户输入，查询需要的信息，进行物品检索与排序。加入增强的组件：记忆机制，先规划后执行结合动态示例的策略，反思机制，以及小模型的工具学习。

# 5.每个模块的3问表

| 模块                     | 解决什么                                          | 实现那个原理/观察                    | 去掉后退化为？                                               |
| ------------------------ | ------------------------------------------------- | ------------------------------------ | ------------------------------------------------------------ |
| 候选总线                 | 工具调用观察项需要被作为提示，但上下文长度有限。  | 解决候选物品过多                     | 传统的检索候选目录的推荐器，每一轮传递当前阶段的候选集，工具调用的信息都放在上下文里。 |
| 用户档案                 | 维护用户信息，可被长期，跨对话存储与更新。        | 长对话能力                           | 把所有信息都维护在上下文信息中，无法跨对话调用用户资料       |
| 先计划后执行             | 提升规划能力，与动态示范策略相匹配，减少LLM调用。 | 提升规划能力，与动态示范策略无缝衔接 | 可能是react类型的模型，且无法设计动态示例。                  |
| 反思                     | 模型有一定纠错能力                                | 大模型偶尔在图里和工具使用上出错     | 简单的无反思纠错能力的LLM模型                                |
| 用小语言模型进行工具学习 | 降低大规模在线服务的成本                          | 参数过大，成本高                     | 回到GPT4这样的大模型上，无蒸馏学习步骤                       |

# 6.主张与实验对应表

| 主张                                                         | 对应实验     | 能否撑住                                                     |
| ------------------------------------------------------------ | ------------ | ------------------------------------------------------------ |
| 为了评估由大型语言模型驱动的交互式推荐代理的效果，我们设计了几种用户模拟策略，用来衡量推荐准确性、终身对话推荐以及长上下文对话推荐的表现。 | Table4、5、6 | 表4强。表五表六中-强：未说明ChatRec4的实验效果               |
| 实验表示InteRecAgent很有效，尤其在世界知识覆盖较少的领域     | 表4，7       | 强：其他模型在Beauty上有大幅度下降，而我们的模型下降幅度更低且依然领先很多 |
| 让小语言模型成为大脑，创建了来自gpt4的模仿数据集，用于微调生成RecLlama，一个轻量模型 | 表8          | 强：小模型RecLlama作为次优基线仅落后于教师模型GPT4           |
| 提出来InteRecAgent，将LLM与三类不同的传统推荐工具连接        | 表4，7       | 中-强：单轮推荐中效果领先，且有表4模拟器评估辅助，但模拟器评估可能有偏差。 |
| 设计增强模块                                                 | 5.5消融实验  | 中-强：未提到候选总线和长短期用户画像模块去除效果会怎么样    |

# 7.复现性核对结果

有公开代码和数据集，还有具体的实验细节。

# 8.与课题的链接

# 9.我没读懂的地方

- 知道会话级交互与单次推荐是两种任务，但是不清楚这两种任务对模型的考验能力的差别，比如gpt4为什么就在单次推荐表现更好，而ChatRec（4）在会话推荐中更好。
- 消融实验为什么不做增强的记忆组件的消融

# 10.下一步与批判意见

我得批判意见：实验设计需要全面说明设计的意图，为什么有些对比实验被省略。没有设置与传统推荐器的单轮推荐的性能测试。为说明部署效率与成本情况。模拟器的偏差没有评估。反思机制未评估，纠错的成功率如何，额外造成的延迟与成本情况如何，以及评估组件的具体判断标准是什么，如果重复次数过多怎么处理，没有记录反思模块输出的内容是什么。

动态演示生成的输入优先策略也没有考虑生成计划的质量如何。先规划机制中如果用户中途改变了自己的意图，系统如何应对？长期记忆机制保存的更像是被压缩的用户画像，而不是用户的一个稳定偏好，会有很多噪声。
